EduardoGMohedano/STM32NUCLEO103_Drivers/examples/UART_send.c
/* This code is aimed to send data through UART1, the same message will be sent only 10 times.
 * UART_send.c
 *
 *  Created on: 27 feb. 2021
 *  Author: Eduardo Garcia
 *  Email: egarciamohedano@gmail.com
 */

#include <stdint.h>
#include "stm32f103.h"
#include "stm32f103_gpio_driver.h"
#include "stm32f103_uart_driver.h"

int main(void)
{
	/* Configure GPIO pin TX, using PA9 */
	GPIO_Handle_t	gpioTX;
	gpioTX.pGPIOx = GPIOA;
	gpioTX.GPIO_PinConfig.PinMode = GPIO_MODE_AF_PP;
	gpioTX.GPIO_PinConfig.PinNumber = 9;
	gpioTX.GPIO_PinConfig.PinSpeed = GPIO_MODE_OUT_LS;
	GPIO_PeriCLKControl(GPIOA,ENABLE);
	GPIO_Init(&gpioTX);

	/* Configure GPIO pin RX, using PA10*/
	GPIO_Handle_t	gpioRX;
	gpioRX.pGPIOx = GPIOA;
	gpioRX.GPIO_PinConfig.PinMode = GPIO_MODE_AF_PP;
	gpioRX.GPIO_PinConfig.PinNumber = 9;
	gpioRX.GPIO_PinConfig.PinSpeed = GPIO_MODE_OUT_LS;
	GPIO_Init(&gpioRX);

	//Initialize AFIO clock
	AFIO_PCLK_EN();

	UART_Handle_t UART_Con;
	UART_Con.pUARTx = UART1;
	UART_Con.UART_Config.Baud_Rate = 19200;
	UART_Con.UART_Config.Mode = UART_MODE_TX_RX;
	UART_Con.UART_Config.Stop_Bits = UART_STOP_BITS_2;
	UART_Con.UART_Config.Word_Length = UART_DATA_LENGTH_7BITS;
	UART_Con.UART_Config.Parity = UART_PARITY_EVEN;
	UART_PeriCLKControl(UART1, ENABLE);
	UART_Init(&UART_Con);

	static char *cadena = "Hola mundo en UART\n";
	for(int i = 0; i<10; i++){
		UART_Write_String(UART1,cadena, 19);
	}

	while(1){
		//Nothing is performed here
	}
	return 0;
}

